app/controllers/users_controller.rb

INSERT INTO "users" ("activation_state", "activation_token", "country", "created_at", "crypted_password", "phone_number", "salt", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "users".* FROM "users" WHERE (username = 'modedemo' OR phone_number = 'modedemo') ORDER BY "users"."id" ASC LIMIT 1
---
	def create
		@user = User.create(user_params)
		if @user
			if @user.errors.size != 0