app/controllers/ussd_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'modedemo' ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "farmer_inputs" ("commodity_grade", "commodity_number", "created_at", "phone_number", "quantity", "session_id", "state", "updated_at", "user_id", "warehouse_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def inbound
    session_id = params["sessionId"]

    # if in cache, respond with the right message
    if (to_store = Rails.cache.read(session_id))
      res = gen_response(0, params["text"])
      new_store = to_store.merge.res
      Rails.cache.write(session_id, new_store)
      if new_store['state'] == 5
        superuser = User.where(username: 'modedemo').first
        FarmerInput.create(warehouse_number: new_store['warehouse_number'],
                           commodity_number: new_store['commodity_number'],
                           quantity: new_store['quantity'],
                           commodity_grade: new_store['grade'],
                           phone_number: new_store['phone_number'],
                           session_id: new_store['session_id'],
                           state: new_store['state'],
                           user: superuser)